{
  "brand": {
    "name": "With Romilly",
    "tagline": "Relax. Rebalance. Restore.",
    "subtitle": "Mobile Reflexologist in West London",
    "email": "romilly@withromilly.com",
    "phone": "+44 7974 182 612",
    "phoneDisplay": "07356 626 138",
    "whatsapp": "https://wa.me/447356626138",
    "location": "Mobile Reflexology in West and NW London",
    "locationShort": "West and NW London",
    "social": { 
      "instagram": "https://instagram.com/with_romilly" 
    }
  },
  "services": [
    {
      "slug": "reflexology",
      "title": "Reflexology",
      "duration": "50 min",
      "price": 85,
      "heroImage": "assets/images/reflex.JPG",
      "summary": "Deeply relaxing and therapeutic; encourages the body to return to a state of homeostasis and bring you back to optimum health.",
      "description": "Reflexology is a well-established, non-invasive complementary therapy which is recognised by the NHS and many hospices. It is a deeply relaxing and stress relieving therapy which can help a wide-range of mental and physical conditions as well as aiding detoxification. It is well known to calm the nervous system and boost the immune system. The body's organs, glands and systems are mapped on our feet, hands and face, and by stimulating these reflex points with reflexology it un-blocks any stagnation, restores balance and promotes the body's own healing processes. Reflexology encourages the body to return to a state of homeostasis and brings it back to optimum health. Each treatment promotes the release of endorphins in the body (feel good hormones), improves circulation and boosts mood and wellbeing.",
      "bullets": [
        "Stimulates the body's natural healing processes",
        "Calms the nervous system and promotes relaxation",
        "Boosts immunity and improves mood"
      ],
      "whoItHelps": [
        "Stress and anxiety",
        "Sleep disorders",
        "Digestive issues",
        "Circulation problems",
        "General wellbeing and detoxification"
      ]
    },
    {
      "slug": "facial-reflexology",
      "title": "Facial Reflexology",
      "duration": "45 min",
      "price": 90,
      "heroImage": "assets/images/service_Facial_reflexology.webp",
      "summary": "Wonderfully calming for your nervous system; relaxes your mind, reduces tension and rejuvenates skin.",
      "description": "Facial Reflexology has the same benefits and principles of foot reflexology and due to the face's close proximity to the brain and cranial nerves, it is very powerful in regards to the level of relaxation and the impact on the body's systems. It helps open up neural pathways, helping to reduce stress levels. Each treatment includes a cleanse, hot towel steam and luxury massage. Facial Reflexology boosts circulation, reduces muscle tension and relieves congestion. It releases emotions held in the face, soothing the nervous system to reduce stress and anxiety and has the added benefit of rejuvenating the skin leaving you calm and radiant.",
      "bullets": [
        "Deeply relaxing and calms the nervous system",
        "Boosts circulation, improves lymph flow and smooths skin",
        "Reduces muscle tension and emotions held in the face",
        "Promotes sleep and smooth skin"
      ],
      "whoItHelps": [
        "Migraines and headaches",
        "Teeth grinding",
        "Sinusitis and hay fever",
        "Bell's palsy",
        "Stress and anxiety"
      ]
    },
    {
      "slug": "pre-conceptual-pregnancy",
      "title": "Pre-Conceptual & Pregnancy Reflexology",
      "duration": "50 min",
      "price": 85,
      "heroImage": "assets/images/service_Preconceptual_reflexology.webp",
      "summary": "Hugely beneficial for your reproductive system; reduces stress, promotes hormonal balance and reduces pregnancy aches and pains.",
      "description": "One of the major ways that Reflexology helps couples to conceive is by reducing stress and balancing hormones because stress and hormonal imbalances can have a major impact on a couple's chance of conceiving. Pre-conceptual Reflexology helps to create the perfect body ecology for a viable and healthy pregnancy. By stimulating certain reflex points, we help balance the endocrine system (responsible for hormonal health). Reflexology gives your body a re-boot - kick-starting the reproductive system, regulating hormonal functions and aiding detoxification so that you are in the best stead for a successful conception. Throughout your pregnancy, reflexology helps reduce aches and pains and brings balance to your mind and body. Reflexology can be helpful post-partum to re-energise, re-balance and aid healing.",
      "bullets": [
        "Helps to balance hormones and reduce stress",
        "Promotes optimal body ecology for a healthy pregnancy",
        "Calms pregnancy aches, pains and morning sickness"
      ],
      "notes": ["Not carried out in the first trimester."],
      "whoItHelps": [
        "Couples trying to conceive",
        "Pregnancy nausea and fatigue",
        "Pregnancy aches and pains",
        "Post-partum recovery",
        "Hormonal imbalances"
      ]
    },
    {
      "slug": "zone-face-lift",
      "title": "Zone Face Lift",
      "duration": "60 min",
      "price": 105,
      "heroImage": "assets/images/service_Zone_Face_Lift.webp",
      "summary": "Award-winning holistic facial combining reflexology, Gua Sha and massage techniques for natural lifting.",
      "description": "The Zone Face Lift facial is an award-winning therapy developed by Ziggie Bergman which has been hailed a credible alternative to Botox. It is a kinder holistic approach to helping you naturally look your best. The results speak for themselves! Each treatment starts with a cleanse, hot towel steam and luxury massage. ZFL combines pressure-point massage, sculpting Gua Sha, along with Native American and Asian massage techniques to gently release emotions held in the face. You will leave the session feeling revived and with a more youthful and 'bright' appearance. Zone Face Lift promotes collagen and elastin production and helps to de-puff the face. It sculpts and smooths your skin, lifts the face and neck, and leaves you feeling deeply relaxed with a truly healthy glow.",
      "bullets": [
        "Combines manual massage with other tools to promote a natural lift",
        "Improves lymphatic drainage and skin elasticity",
        "Hailed a credible alternative to botox",
        "Reduces puffiness and tension, releases stress held in face",
        "Boosts collagen and elastin"
      ],
      "whoItHelps": [
        "Signs of ageing and fine lines",
        "Facial puffiness and tension",
        "Dull complexion",
        "Emotional stress held in face",
        "Overall skin health and glow"
      ]
    }
  ],
  "policies": {
    "payment": "25% taken at time of booking. 75% balance taken after treatment.",
    "cancellation": "-48hrs prior appt: postpone/cancel free of charge. -25hrs prior appt: postpone by 1 week free of charge or 50% cancellation charge. Less than 25hrs prior appt/On the day of appt/no show: 100% cancellation charge.",
    "consultation": "Please complete the consultation form before your treatment.",
    "mobile": "Mobile reflexology treatments available in West and NW London.",
    "eveningFee": "Appointments after 6:30pm have a 10% surcharge.",
    "note": "Please note: Reflexologists do not give medical diagnosis or treatment but do correct imbalances that are revealed in each session. It is your responsibility to consult your GP about any pain, problem or illness that you are presently aware of, or become alerted to the possibility of as a result of a session."
  },
  "testimonials": [
    {
      "quote": "Romilly's treatments are so therapeutic, and I can feel the tension melting away throughout each session. After 4 sessions my symptoms really improved and I felt not only physically rejuvenated but also mentally and emotionally refreshed. Romilly has a remarkable ability to create a soothing atmosphere that instantly puts you at ease and I'd wholeheartedly recommend her to anyone seeking alternative healing, relaxation or stress relief.",
      "author": "Alexandra S"
    },
    {
      "quote": "The facial reflexology was incredible. Not only did my skin look radiant, but I felt so calm and centred afterwards.",
      "author": "Sarah M"
    },
    {
      "quote": "Romilly helped me so much during my pregnancy. Her gentle approach and expertise made all the difference to my wellbeing.",
      "author": "Emma T"
    }
  ],
  "recommends": [
    { 
      "name": "Hayou Method Bamboo Body Tapper", 
      "image": "assets/images/bamboobodytapper.webp", 
      "description": "Gentle body tapping for circulation and lymphatic drainage. The Hayou Method body tapper helps stimulate blood flow and supports the lymphatic system.",
      "url": "https://hayoumethod.com" 
    },
    { 
      "name": "Theta Naturals Co. Connect & Restore Bath Salts", 
      "image": "assets/images/theta-salts.webp", 
      "description": "Mineral-rich bath salts for deep relaxation and muscle relief. Infused with natural ingredients to help you unwind and restore.",
      "url": "https://thetanaturalsco.com" 
    },
    { 
      "name": "White Sage Smudge Stick", 
      "image": "assets/images/Smudge.webp", 
      "description": "Traditional cleansing and purifying ritual for your space. Used for centuries to clear negative energy and create sacred space.",
      "url": "#" 
    },
    { 
      "name": "Two Libras Amethyst Heart Worry Stone", 
      "image": "assets/images/Amethyst.webp", 
      "description": "Calming crystal for stress relief and emotional balance. Amethyst is known for its soothing properties and ability to promote inner peace.",
      "url": "#" 
    }
  ],
  "about": {
    "short": "I am a qualified Reflexology practitioner and an insured member of the Association of Reflexologists, trained at the prestigious London School of Reflexology. As well as classic Reflexology, I am trained in Pre-Conceptual and Pregnancy Reflexology, Facial Reflexology and holistic Zone Face Lift facials. I also have a diploma in Naturopathy and have a wide knowledge and interest in other complementary therapies and how they can help and heal us in different ways.",
    "long": "I am a qualified Reflexology practitioner and an insured member of the Association of Reflexologists, trained at the prestigious London School of Reflexology. As well as classic Reflexology, I am trained in Pre-Conceptual and Pregnancy Reflexology, Facial Reflexology and holistic Zone Face Lift facials. I also have a diploma in Naturopathy and have a wide knowledge and interest in other complementary therapies and how they can help and heal us in different ways. I have a particular interest in women's health and how balancing the mind, body and emotions with Reflexology is often exactly what we need to lead a happier and healthier life. I truly believe that our bodies have the ability to heal themselves, with a little nurturing and gentle rebalancing.",
    "qualifications": [
      "Qualified Reflexologist, London School of Reflexology",
      "Member of the Association of Reflexologists",
      "Diploma in Naturopathy & Nutrition for Everyday Living",
      "Pre-Conceptual and Pregnancy Reflexology trained",
      "Facial Reflexology and Zone Face Lift certified",
      "Fully insured and certified"
    ]
  },
  "blog": [
    {
      "id": "winter-wellness-reflexology",
      "title": "Winter Wellness with Reflexology",
      "date": "2025-11-15",
      "summary": "As the days grow shorter and colder, our bodies naturally crave more rest. Discover how reflexology can support your immune system during the winter months.",
      "content": "<p>Winter is a time for turning inward. Nature slows down, and so should we. In Traditional Chinese Medicine, winter is associated with the Water element and the Kidneys, which store our vital essence or 'Jing'.</p><p>Reflexology is a wonderful way to support your body during this season. By stimulating the reflexes associated with the immune system—specifically the lymphatic system and the spleen—we can give our natural defences a boost.</p><p>During a winter session, I focus particularly on the kidney meridian points on the feet to help nourish your energy reserves, leaving you feeling grounded and restored.</p>",
      "image": "assets/images/stones.webp"
    },
    {
      "id": "facial-reflexology-stress",
      "title": "The Benefits of Facial Reflexology for Stress",
      "date": "2025-10-10",
      "summary": "Facial reflexology is not just a beauty treatment; it's a powerful tool for calming the nervous system and reducing stress.",
      "content": "<p>Our faces hold a tremendous amount of tension. When we are stressed, we often unknowingly clench our jaws or furrow our brows. Facial Reflexology works directly with the cranial nerves and the central nervous system to release this held tension.</p><p>Because the face is so close to the brain, the effects of facial reflexology are often felt very quickly. Clients frequently report falling into a deep state of relaxation within minutes.</p><p>Beyond the deep sense of calm, this treatment boosts circulation to the face, giving you a natural, healthy glow—a perfect antidote to the stress of daily life.</p>",
      "image": "assets/images/service_Facial_reflexology.webp"
    },
    {
      "id": "balancing-energy-levels",
      "title": "Back to Routine: Balancing Energy Levels",
      "date": "2025-09-05",
      "summary": "September often brings a return to routine. Here’s how to maintain your energy levels without burning out.",
      "content": "<p>After the relaxed pace of summer, September can feel like a jolt to the system. The return to school runs, tighter work schedules, and earlier evenings can be draining.</p><p>Reflexology can help balance your energy levels by regulating the endocrine system. We focus on the adrenal reflexes to manage cortisol levels (the stress hormone) and the thyroid reflex to support metabolism and energy production.</p><p> taking an hour for yourself to rebalance can make the transition into autumn much smoother and more manageable.</p>",
      "image": "assets/images/reflex.JPG"
    },
    {
      "id": "summer-foot-health",
      "title": "Summer Self-Care: Hydration and Foot Health",
      "date": "2025-08-12",
      "summary": "Summer means sandals and bare feet! Tips for keeping your feet healthy and your body hydrated.",
      "content": "<p>In the heat of summer, our feet can often swell or feel tired. Staying hydrated is crucial, not just for your overall health but for your tissues and joints.</p><p>A simple self-care tip is to roll a frozen water bottle under the arches of your feet at the end of a hot day. This helps cool the blood and reduce inflammation.</p><p>Regular reflexology treatments during the summer also help improve circulation and reduce fluid retention (oedema) in the ankles and legs.</p>",
      "image": "assets/images/spa.webp"
    },
    {
      "id": "pregnancy-reflexology-support",
      "title": "Pregnancy and Reflexology: A Gentle Support",
      "date": "2025-07-20",
      "summary": "How reflexology can support you and your baby through the trimesters of pregnancy.",
      "content": "<p>Pregnancy is a time of immense change for the body. Hormones fluctuate, the skeletal structure shifts, and sleep can be elusive. Reflexology offers a safe, non-invasive way to support these changes.</p><p>In the second and third trimesters, reflexology can be particularly helpful for common complaints like backache, digestive issues, and swelling.</p><p>It also provides a precious hour of calm connection with your baby, allowing your body to relax completely and prepare for labour.</p>",
      "image": "assets/images/service_Preconceptual_reflexology.webp"
    },
    {
      "id": "boost-immunity-naturally",
      "title": "Natural Ways to Boost Immunity",
      "date": "2025-06-15",
      "summary": "As we move into summer, it's still important to keep our immune system strong. Here are some naturopathic tips.",
      "content": "<p>A strong immune system relies on a healthy gut. Including probiotic-rich foods like sauerkraut, kimchi, or kefir in your diet can support your microbiome.</p><p>Vitamin C is also vital, and summer berries are packed with it! Eating seasonally is one of the best things you can do for your health.</p><p>Reflexology supports immunity by stimulating the lymphatic system, helping the body to eliminate toxins and circulate white blood cells more efficiently.</p>",
      "image": "assets/images/bamboobodytapper.webp"
    },
    {
      "id": "zone-face-lift-explained",
      "title": "Understanding the Zone Face Lift",
      "date": "2025-05-22",
      "summary": "What makes the Zone Face Lift different from a standard facial? Exploring this 'spiritual facelift'.",
      "content": "<p>The Zone Face Lift is often called a 'spiritual facelift' because it works on more than just the physical appearance. It combines traditional reflexology points on the face with ancient healing techniques from Native American and Asian traditions.</p><p>Using tools like Gua Sha crystals, we gently sculpt and lift the facial muscles. But we also work to release emotions held in the face—worry lines, jaw tension, and furrowed brows often soften significantly after a treatment.</p><p>The result is a glowing complexion and a deeply peaceful state of mind.</p>",
      "image": "assets/images/service_Zone_Face_Lift.webp"
    },
    {
      "id": "spring-detox-reflexology",
      "title": "Spring Cleaning Your Body with Detox Reflexology",
      "date": "2025-04-08",
      "summary": "Spring is the season of the Liver. Learn how to support your body's natural detoxification processes.",
      "content": "<p>In Traditional Chinese Medicine, spring is associated with the Wood element and the Liver. It's the perfect time to focus on detoxification and letting go of what no longer serves us.</p><p>During spring treatments, I focus on the liver and gall bladder reflexes. This can help with sluggish digestion, headaches, and feelings of frustration or irritability.</p><p>Drinking plenty of water with lemon and moving your body gently every day are simple ways to support this seasonal shift.</p>",
      "image": "assets/images/stones.webp"
    },
    {
      "id": "sleep-better-insomnia",
      "title": "Sleep Better: Reflexology for Insomnia",
      "date": "2025-03-14",
      "summary": "Struggling to sleep? Discover how reflexology can reset your circadian rhythm and promote deep rest.",
      "content": "<p>Sleep is the foundation of health, yet so many of us struggle to get enough of it. Reflexology is renowned for its ability to improve sleep quality.</p><p>By stimulating the pineal gland reflex, we can help regulate the production of melatonin, the sleep hormone. We also work with the solar plexus point, which is the centre of emotional relaxation in the body.</p><p>Many clients report having the best night's sleep they've had in years after a session.</p>",
      "image": "assets/images/reflex.JPG"
    },
    {
      "id": "heart-health-self-love",
      "title": "Self-Love and Heart Health",
      "date": "2025-02-10",
      "summary": "February is often associated with hearts. Let's look at caring for our emotional heart through holistic therapies.",
      "content": "<p>Self-care is the ultimate form of self-love. Taking time out of your busy schedule to lie down, close your eyes, and be cared for is incredibly healing.</p><p>Reflexology can help open the chest area and improve circulation, supporting physical heart health. Emotionally, it helps to release grief or sadness that may be stored in the body.</p><p>This month, treat yourself with the same kindness and attention you give to others.</p>",
      "image": "assets/images/Amethyst.webp"
    },
    {
      "id": "new-year-naturopathy",
      "title": "New Year, New Balance: Naturopathy Tips",
      "date": "2025-01-05",
      "summary": "Instead of harsh resolutions, try gentle naturopathic adjustments to start your year with balance.",
      "content": "<p>January often brings a pressure to 'fix' ourselves with extreme diets or fitness regimes. As a Naturopath, I believe in gentle, sustainable changes.</p><p>Start by simply increasing your water intake and adding one more portion of vegetables to your daily meals. Focus on nourishment rather than restriction.</p><p>Reflexology can support any new healthy habits by keeping your body in a state of balance and reducing the stress that often leads us to fall back into old patterns.</p>",
      "image": "assets/images/theta-salts.webp"
    },
    {
      "id": "managing-holiday-stress",
      "title": "Managing Holiday Stress Naturally",
      "date": "2024-12-01",
      "summary": "The festive season can be overwhelming. Here are some tips to stay grounded and calm.",
      "content": "<p>The holidays are a time of joy, but also of high expectations and busy schedules. It's easy to run on empty.</p><p>Remember to breathe. Deep belly breathing activates the parasympathetic nervous system—your 'rest and digest' mode. Even just five minutes a day can make a difference.</p><p>Reflexology is a perfect way to take a pause during the festive rush. It allows you to disconnect from the noise and reconnect with yourself, so you can enjoy the season fully.</p>",
      "image": "assets/images/Smudge.webp"
    }
  ]
}
