{
  "brand": {
    "name": "With Romilly",
    "tagline": "Relax. Rebalance. Restore.",
    "email": "withromilly@gmail.com",
    "phone": "+44 7974 182 612",
    "phoneDisplay": "07974 182 612",
    "location": "Queen's Park, W9 3HJ, London",
    "social": { 
      "instagram": "https://instagram.com/with_romilly" 
    }
  },
  "services": [
    {
      "slug": "reflexology",
      "title": "Reflexology",
      "duration": "50 min",
      "price": 75,
      "heroImage": "/assets/images/svc-reflexology.jpg",
      "summary": "Deeply relaxing and restorative; supports nervous and immune systems, encourages detoxification.",
      "description": "A deeply relaxing, non-invasive therapy that supports the nervous and immune systems, encourages detoxification and restores balance. By stimulating reflex points mapped to the body's organs and systems, Reflexology helps release stagnation and promotes natural healing.",
      "bullets": [
        "Calms the nervous system and boosts immunity",
        "Stimulates mapped reflex points to release stagnation",
        "Promotes the body's natural healing"
      ],
      "whoItHelps": [
        "Stress and anxiety",
        "Sleep disorders",
        "Digestive issues",
        "Circulation problems",
        "General wellbeing"
      ]
    },
    {
      "slug": "facial-reflexology",
      "title": "Facial Reflexology",
      "duration": "45 min",
      "price": 80,
      "heroImage": "/assets/images/svc-facial-reflexology.jpg",
      "summary": "Powerfully calming; boosts circulation, eases tension and rejuvenates skin.",
      "description": "Combines cleanse, hot towel steam and luxury facial massage. Powerfully calming for the nervous system due to proximity to cranial nerves; boosts circulation, eases tension and rejuvenates skin for a radiant, relaxed complexion.",
      "bullets": [
        "Cleanse, hot towel steam and luxury facial massage",
        "Supports cranial nerves for deep relaxation",
        "Radiant, calm complexion"
      ],
      "whoItHelps": [
        "Facial tension and TMJ",
        "Headaches and migraines",
        "Sinus congestion",
        "Skin concerns",
        "Stress relief"
      ]
    },
    {
      "slug": "pre-conceptual-pregnancy",
      "title": "Pre-Conceptual & Pregnancy Reflexology",
      "duration": "50 min",
      "price": 75,
      "heroImage": "/assets/images/svc-preconception.jpg",
      "summary": "Supports hormonal balance, reduces stress and helps during pregnancy.",
      "description": "Supports hormonal balance, reduces stress and prepares the body for conception and a healthy pregnancy. During pregnancy, it helps ease common symptoms and maintain equilibrium. Post-partum, it aids recovery and re-balancing.",
      "bullets": [
        "Prepares the body for conception",
        "Eases pregnancy symptoms naturally",
        "Supports post-partum recovery"
      ],
      "notes": ["Not carried out in the first trimester."],
      "whoItHelps": [
        "Trying to conceive",
        "Pregnancy nausea and fatigue",
        "Anxiety during pregnancy",
        "Post-partum recovery",
        "Hormonal imbalances"
      ]
    },
    {
      "slug": "zone-face-lift",
      "title": "Zone Face Lift",
      "duration": "60 min",
      "price": 95,
      "heroImage": "/assets/images/svc-zfl.jpg",
      "summary": "Award-winning holistic facial; lifts, sculpts and revives with a natural glow.",
      "description": "An award-winning holistic facial combining facial reflexology, sculpting Gua Sha and specialised massage. Promotes collagen and elastin, de-puffs and lifts for a brighter appearance — while leaving you deeply relaxed.",
      "bullets": [
        "Facial reflexology, sculpting Gua Sha and specialised massage",
        "Promotes collagen and elastin",
        "De-puffs and lifts face and neck"
      ],
      "whoItHelps": [
        "Signs of ageing",
        "Facial puffiness",
        "Dull complexion",
        "Muscle tension",
        "Overall skin health"
      ]
    }
  ],
  "policies": {
    "deposit": "A 25% deposit is required.",
    "cancellation": "24 hours' notice to cancel or rearrange; otherwise full fee applies.",
    "consultation": "Please complete the consultation form before your treatment.",
    "mobile": "Mobile visits within 5 miles of W9 carry a £10 fee."
  },
  "testimonials": [
    {
      "quote": "Romilly's treatments are so therapeutic — I could feel the tension melting away. After 4 sessions I felt physically rejuvenated and emotionally refreshed.",
      "author": "Alexandra S"
    },
    {
      "quote": "The facial reflexology was incredible. Not only did my skin look radiant, but I felt so calm and centred afterwards.",
      "author": "Sarah M"
    },
    {
      "quote": "Romilly helped me so much during my pregnancy. Her gentle approach and expertise made all the difference to my wellbeing.",
      "author": "Emma T"
    }
  ],
  "recommends": [
    { 
      "name": "Hayou Method Bamboo Body Tapper", 
      "image": "/assets/images/rec-hayou.jpg", 
      "description": "Gentle body tapping for circulation and lymphatic drainage",
      "url": "#" 
    },
    { 
      "name": "Theta Naturals Co. Connect & Restore Bath Salts", 
      "image": "/assets/images/rec-theta.jpg", 
      "description": "Mineral-rich salts for deep relaxation and muscle relief",
      "url": "#" 
    },
    { 
      "name": "White Sage Smudge Stick", 
      "image": "/assets/images/rec-sage.jpg", 
      "description": "Cleansing and purifying ritual for your space",
      "url": "#" 
    },
    { 
      "name": "Two Libras Amethyst Heart Worry Stone", 
      "image": "/assets/images/rec-amethyst.jpg", 
      "description": "Calming crystal for stress relief and emotional balance",
      "url": "#" 
    }
  ],
  "about": {
    "short": "I'm Romilly — a qualified Reflexologist trained at the London School of Reflexology and a member of the Association of Reflexologists. I specialise in women's health across Reflexology, Facial Reflexology, Pre-conceptual & Pregnancy Reflexology, and Zone Face Lift. My approach is gentle, restorative and tailored to help you feel calm, balanced and well.",
    "long": "Welcome to With Romilly. I'm a qualified Reflexologist, trained at the prestigious London School of Reflexology and a member of the Association of Reflexologists. My practice focuses on women's health and wellbeing, offering a sanctuary where you can truly relax, rebalance and restore. I specialise in traditional Reflexology, Facial Reflexology, Pre-conceptual & Pregnancy Reflexology, and the award-winning Zone Face Lift technique. My approach is gentle, restorative and completely tailored to your individual needs. Whether you're seeking stress relief, support during pregnancy, or simply want to reconnect with your sense of calm, I'm here to guide you on that journey.",
    "qualifications": [
      "Qualified Reflexologist, London School of Reflexology",
      "Member of the Association of Reflexologists",
      "Fully insured and certified",
      "Specialist in women's health and pregnancy"
    ]
  }
}